src/_k6/results/202607131327/bun-app-v1.3.14_1rec_60svus_50_summary.txt
     ✓ bun-app-v1.3.14 status is 200
     ✓ bun-app-v1.3.14 response is JSON
     ✓ bun-app-v1.3.14 response has all data records
     ✓ bun-app-v1.3.14 response first item has expected fields

     checks.........................: 100.00% ✓ 859164      ✗ 0     
     data_received..................: 184 MB  2.6 MB/s
     data_sent......................: 108 MB  1.5 MB/s
     http_req_blocked...............: avg=2.21µs  min=710ns    med=1.72µs  max=10.65ms  p(90)=2.31µs  p(95)=2.65µs  p(99)=7.02µs  
     http_req_connecting............: avg=45ns    min=0s       med=0s      max=1.05ms   p(90)=0s      p(95)=0s      p(99)=0s      
   ✓ http_req_duration..............: avg=14.93ms min=730.65µs med=13.86ms max=330.92ms p(90)=27.52ms p(95)=34.23ms p(99)=46.37ms 
       { expected_response:true }...: avg=14.93ms min=730.65µs med=13.86ms max=330.92ms p(90)=27.52ms p(95)=34.23ms p(99)=46.37ms 
   ✓ http_req_failed................: 0.00%   ✓ 0           ✗ 214791
     http_req_receiving.............: avg=35.7µs  min=7.52µs   med=20.69µs max=25.38ms  p(90)=33.9µs  p(95)=47.27µs p(99)=264.95µs
     http_req_sending...............: avg=25.17µs min=2.73µs   med=6.31µs  max=25.93ms  p(90)=12.55µs p(95)=52.45µs p(99)=494.07µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      p(99)=0s      
     http_req_waiting...............: avg=14.87ms min=708.77µs med=13.8ms  max=330.68ms p(90)=27.46ms p(95)=34.17ms p(99)=46.27ms 
     http_reqs......................: 214791  3067.874961/s
     iteration_duration.............: avg=15.12ms min=875.59µs med=14.04ms max=331.4ms  p(90)=27.74ms p(95)=34.45ms p(99)=46.57ms 
     iterations.....................: 214791  3067.874961/s
     vus............................: 50      min=5         max=50  
     vus_max........................: 50      min=50        max=50