src/_k6/results/202607131327/bun-app-v1.3.14_nested_100rec_2depth_60svus_50_summary.txt
     ✓ bun-app-v1.3.14 status is 200
     ✓ bun-app-v1.3.14 response is JSON
     ✓ bun-app-v1.3.14 response has all records
     ✓ bun-app-v1.3.14 response has nested structure

     checks.........................: 100.00% ✓ 371664      ✗ 0    
     data_received..................: 371 MB  5.3 MB/s
     data_sent......................: 11 MB   150 kB/s
     http_req_blocked...............: avg=12.83µs  min=1.03µs   med=2.16µs  max=71.93ms  p(90)=3.25µs   p(95)=4.06µs  p(99)=11.2µs  
     http_req_connecting............: avg=8.51µs   min=0s       med=0s      max=71.85ms  p(90)=0s       p(95)=0s      p(99)=0s      
   ✓ http_req_duration..............: avg=31.75ms  min=490.5µs  med=30.44ms max=207.83ms p(90)=51.97ms  p(95)=62.56ms p(99)=92.53ms 
       { expected_response:true }...: avg=31.75ms  min=490.5µs  med=30.44ms max=207.83ms p(90)=51.97ms  p(95)=62.56ms p(99)=92.53ms 
   ✓ http_req_failed................: 0.00%   ✓ 0           ✗ 92916
     http_req_receiving.............: avg=2.56ms   min=7µs      med=18.05µs max=184.87ms p(90)=209.32µs p(95)=20.74ms p(99)=57.9ms  
     http_req_sending...............: avg=922.59µs min=3.24µs   med=7.24µs  max=166.14ms p(90)=841.77µs p(95)=1.31ms  p(99)=24.55ms 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      p(99)=0s      
     http_req_waiting...............: avg=28.26ms  min=461.54µs med=28.23ms max=141.15ms p(90)=46.07ms  p(95)=51.06ms p(99)=63ms    
     http_reqs......................: 92916   1326.745157/s
     iteration_duration.............: avg=34.96ms  min=1.24ms   med=32.58ms max=231.46ms p(90)=58.21ms  p(95)=74.01ms p(99)=104.95ms
     iterations.....................: 92916   1326.745157/s
     vus............................: 50      min=5         max=50 
     vus_max........................: 50      min=50        max=50