src/_k6/results/202607131327/fastapi-app-v0.139.0_10rec_60svus_1_summary.txt
     ✓ fastapi-app-v0.139.0 status is 200
     ✓ fastapi-app-v0.139.0 response is JSON
     ✓ fastapi-app-v0.139.0 response has all data records
     ✓ fastapi-app-v0.139.0 response first item has expected fields

     checks.........................: 100.00% ✓ 75496      ✗ 0    
     data_received..................: 140 MB  2.0 MB/s
     data_sent......................: 9.6 MB  137 kB/s
     http_req_blocked...............: avg=4.23µs  min=1.32µs  med=3.58µs  max=1.17ms   p(90)=5.94µs  p(95)=6.64µs   p(99)=22.79µs 
     http_req_connecting............: avg=10ns    min=0s      med=0s      max=192.88µs p(90)=0s      p(95)=0s       p(99)=0s      
   ✓ http_req_duration..............: avg=2.31ms  min=1.25ms  med=1.81ms  max=41.24ms  p(90)=3.68ms  p(95)=3.96ms   p(99)=5.18ms  
       { expected_response:true }...: avg=2.31ms  min=1.25ms  med=1.81ms  max=41.24ms  p(90)=3.68ms  p(95)=3.96ms   p(99)=5.18ms  
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 18874
     http_req_receiving.............: avg=62.4µs  min=19.92µs med=55.13µs max=2.64ms   p(90)=98.82µs p(95)=125.39µs p(99)=176.03µs
     http_req_sending...............: avg=34.77µs min=4.37µs  med=12.93µs max=2.97ms   p(90)=27.39µs p(95)=133.1µs  p(99)=642.29µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=2.21ms  min=1.21ms  med=1.71ms  max=41.18ms  p(90)=3.53ms  p(95)=3.76ms   p(99)=4.95ms  
     http_reqs......................: 18874   269.608478/s
     iteration_duration.............: avg=3.69ms  min=1.77ms  med=3.29ms  max=41.94ms  p(90)=5.77ms  p(95)=6.29ms   p(99)=8.04ms  
     iterations.....................: 18874   269.608478/s
     vus............................: 1       min=1        max=1  
     vus_max........................: 1       min=1        max=1